using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Exam
{
    class AnswersToQuestion
    {
        /* 
         1.Нельзя изменять строку.
         2.Рефлексия - это рентген какого либо приложения. Она видит все внутренности приложения, все его составные элементы, такие как: классы, свойства и т.д.
         Пример: 
         3.Сериализация - это превращение объектов в поток байтов.
         Пример у меня в коде.
         4.    interface IAnswer<T> where T: IDisposable
               {
        
                }
         5.Абстрактный класс может содержать реализацию методов, полей и т.д. а интерфейс имеет только прототипы.
         Абстрактный класс наследуется, а интерфейс реализуется. Наследовать мы можем 1 класс, а реализовать сколько угодно.
         6.nullable тип может принимать null значения.
         */

    }
}
